Repository: LinesPrower/funduck-ess
Catalog: locale/*/LC_MESSAGES/Funduck.po
Languages: ru

source: Copy
ru: Копировать

source: Paste
ru: Вставить

source: Select a factor
ru: Выбрать фактор

source: Select a goal
ru: Выбрать цель

source: Add an extra goal
ru: Добавить дополнительную цель

source: Clear node
ru: Очистить узел

source: Edit factor
ru: Редактировать фактор

source: Edit goal
ru: Редактировать цель

source: File
ru: Файл

source: New expert system
ru: Новая экспертная система

source: Open...
ru: Открыть...

source: Save
ru: Сохранить

source: Save as...
ru: Сохранить как...

source: Export the decision tree to PNG...
ru: Экспорт дерева решений в PNG...

source: Export the rules list...
ru: Экспорт списка правил...

source: Check the system
ru: Проверить систему

source: Run the system
ru: Запустить систему

source: About...
ru: О программе...

source: Exit
ru: Выход

source: Edit
ru: Редактирование

source: Undo
ru: Отменить

source: Redo
ru: Повторить

source: Goals...
ru: Цели...

source: Factors...
ru: Факторы...

source: Expert system description...
ru: Описание экспертной системы...

source: Help
ru: Справка

source: Toolbar
ru: Панель инструментов

source: Save changes in expert system "%s"?
ru: Сохранить изменения в экспертной системе "%s"?

source: An error occurred while opening file "%s"
ru: Ошибка открытия файла "%s"

source: Open File
ru: Открыть файл

source: An error occurred while writing to file "%s"
ru: Ошибка записи в файл "%s"

source: Save to File
ru: Ошибка записи в файл "%s"

source: Export to PNG
ru: Экспорт в PNG

source: There are errors in the expert system. Fix the errors and try again.
ru: Экспертная система содержит ошибки. Устраните ошибки и попробуйте снова.

source: AND
ru: И

source: IF %s THEN %s;
ru: ЕСЛИ %s ТО %s;

source: Number of rules: %d
ru: Число правил: %d

source: Rules
ru: Правила

source: <b>%s - An expert system shell</b><br/>Version %s <br/> Copyright © 2018 Damir Akhmetzyanov (linesprower@gmail.com) <br/> <br/> Funduck ESS is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. <br/> <br/> This program uses icons from the <a href="http://p.yusukekamiyamane.com/index.html.en">Fugue Icons</a> set by Yusuke Kamiyamane licensed under <a href="https://creativecommons.org/licenses/by/3.0/">CC BY 3.0</a> <br/> <br/> The "Duckling" logo by <a href="https://smashicons.com/">SmashIcons</a> from <a href="www.flaticon.com">www.flaticon.com</a>
ru: <b>%s - Оболочка для экспертных систем</b><br/>Версия %s <br/> Copyright © 2018 Ахметзянов Дамир (linesprower@gmail.com) <br/> <br/> Это свободная программа: вы можете перераспространять её и/или изменять её на условиях Стандартной общественной лицензии GNU в том виде, в каком она была опубликована Фондом свободного программного обеспечения; либо версии 3 лицензии, либо (по вашему выбору) любой более поздней версии. <br/> <br/> Данный программный продукт использует пиктограммы из набора <a href="http://p.yusukekamiyamane.com/index.html.en">Fugue Icons</a> от Yusuke Kamiyamane по лицензии <a href="https://creativecommons.org/licenses/by/3.0/">CC BY 3.0</a> <br/> <br/> Логотип "Duckling" от <a href="https://smashicons.com/">SmashIcons</a> с сайта <a href="www.flaticon.com">www.flaticon.com</a>

source: About %s
ru: О программе %s

source: View license text
ru: Лицензионное соглашение

source: License Agreement
ru: Лицензионное соглашение

source: ES Check Results
ru: Результаты проверки системы

source: Incomplete node
ru: Незавершённый узел

source: Factor "%s" is used more than once in the same branch
ru: Фактор "%s" используется более одного раза в одной ветке дерева

source: Target "%s" is not used
ru: Цель "%s" не использована

source: Factor "%s" is not used
ru: Фактор "%s" не использован

source: No problems detected
ru: Проблем не обнаружено

source: Delete
ru: Удалить

source: Close
ru: Закрыть

source: Cancel
ru: Отмена

source: Expert system description
ru: Описание экспертной системы

source: Name
ru: Название

source: Description
ru: Описание

source: Name cannot be empty
ru: Название не может быть пустым

source: Restart (F2)
ru: Начать сначала (F2)

source: Session is over
ru: Ceaнс завершён

source: Incomplete node reached
ru: Достигнут незавершённый узел

source: Use digit buttons on the keyboard to choose answers quickly
ru: Используйте цифры на клавиатуре для быстрого выбора ответов

source: Results
ru: Результат

source: Factor name cannot be empty
ru: Название фактора не может быть пустым

source: Factor with this name already exists
ru: Фактор с таким названием уже существует

source: Add a Factor
ru: Добавление фактора

source: Edit Factor
ru: Редактирование фактора

source: Values
ru: Значения

source: Binary
ru: Бинарный

source: Text
ru: Текстовый

source: Type
ru: Тип фактора

source: A factor should have at least two values
ru: Фактор должен иметь хотя бы два значения

source: All values must be different
ru: Все значения должны быть разными

source: Factors
ru: Факторы

source: Add a factor (Ins)
ru: Добавить фактор (Ins)

source: Edit factor (Enter)
ru: Редактировать фактор (Enter)

source: Delete factor (Del)
ru: Удалить фактор (Del)

source: You should select a factor first
ru: Необходимо выбрать фактор

source: This factor is used in the tree and cannot be deleted
ru: Фактор используется в дереве и не может быть удалён

source: Goal name cannot be empty
ru: Название цели не может быть пустым

source: A goal with this name already exists
ru: Цель с таким названием уже существует

source: Add a Goal
ru: Добавление цели

source: Edit Goal
ru: Редактирование цели

source: Select a Goal
ru: Выбор цели

source: Goals
ru: Цели

source: Add a goal (Ins)
ru: Добавить цель (Ins)

source: Edit goal (Enter)
ru: Редактировать цель (Enter)

source: Delete goal (Del)
ru: Удалить цель (Del)

source: You should select a goal first
ru: Необходимо выбрать цель

source: This goal is used in the tree and cannot be deleted
ru: Цель используется в дереве и не может быть удалена

source: Expert system
ru: Экспертная система

source: Unnamed
ru: Без имени

source: Yes
ru: Да

source: No
ru: Нет

source: Select a factor or goal
ru: Выберите фактор или цель
